import type { 弹药类型 } from '../../模型/弹药'

export const 六八训练弹: 弹药类型 = {
    名称: '6.8x51 训练弹',
    口径: '6.8x51',
    穿甲等级: 2,
    伤害: 40,
    描述: '采用传统全黄铜弹壳的 6.8x51 弹，膛压比军用混合弹壳版低得多，初速和射程都有所下降，主要用于日常训练，也能减轻枪管的磨损。',
}

export const 点二七七Fury弹: 弹药类型 = {
    名称: '.277 SIG Fury',
    口径: '6.8x51',
    穿甲等级: 3,
    伤害: 46,
    描述: 'SIG 推出的民用版本，采用钢制底座加黄铜弹身的混合弹壳，能承受接近 80000 psi 的膛压。短枪管也能打出接近全威力步枪弹的初速，但后坐力和枪口焰都很猛。',
}

export const 实验性M1186弹: 弹药类型 = {
    名称: 'XM1186 GP',
    口径: '6.8x51',
    穿甲等级: 5,
    伤害: 47,
    描述: '美军“下一代班组武器”（NGSW）计划的通用弹，配发给 XM7 步枪和 XM250 机枪。弹头带钢制穿甲尖，思路与 M855A1 相似，专门为在较远距离击穿现代防弹插板而设计。',
}
