import type { 数值, 文本, 布尔 } from '../讲中文才飞'

export type 枪械类型 =
      '左轮手枪'
    | '半自动 / 自动手枪'
    | '冲锋枪'
    | '突击步枪'
    | '精确射手步枪'
    | '霰弹枪'
    | '机枪'
    | '栓动步枪'

export type 枪械击发模式类型 =
    | '栓动'
    | '泵动'
    | '半自动'
    | '全自动'
    | { 模式: '爆发', 开火数: 数值 }

export type 子弹口径类型 =
    // 手枪弹
    | '.22 LR'
    | '.357 Magnum'
    | '.44 Magnum'
    | '.45 ACP'
    | '9×19'
    | '7.62×25'
    | '5.7×28'
    | '4.6×30'
    // 亚音速穿甲弹
    | '9x39'
    // 中间威力步枪弹
    | '5.45×39'
    | '5.56×45'
    | '.223'
    | '5.8×42'
    | '.300 BLK'
    | '7.62×39'
    // 全威力步枪弹
    | '6.8×51'
    | '7.62×51 NATO'
    | '7.62×54 R'
    | '.338 Lapua'
    | '12.7×99'
    | '12.7×108'
    // 霰弹
    | '12 号霰弹'
    | '20 号霰弹'
    | '.410 霰弹'
    // 中国特色
    | '35mm 榴弹'

export type 安装接口类型 =
      '根组件'
    | '直接连接'
    | '枪管螺纹连接'
    | '专用连接点'
    | { 类型: '导轨连接', 槽位数: 数值 }

export type 拆装模式类型 = '快拆，无需校枪' | '快拆，需要校枪' | '非快拆'
