import type { 数值型, 文本型, 布尔型, 部分 } from '../讲中文才飞'

export type 枪械类型 =
      '左轮手枪'
    | '半自动 / 自动手枪'
    | '冲锋枪'
    | '突击步枪'
    | '精确射手步枪'
    | '霰弹枪'
    | '机枪'
    | '栓动步枪'

export type 枪械击发模式类型 =
    | '栓动'
    | '泵动'
    | '半自动'
    | '全自动'
    | { 模式: '爆发', 开火数: 数值型 }

export type 子弹口径类型 =
    // 手枪弹
    | '.22 LR'
    | '.357 Magnum'
    | '.44 Magnum'
    | '.45 ACP'
    | '9x19'
    | '7.62x25'
    | '5.7x28'
    | '4.6x30'
    // VSS 的穿甲弹
    | '9x39'
    // 中间威力步枪弹
    | '5.45x39'
    | '5.56x45'
    | '5.8x42'
    | '7.62x39'
    // 全威力步枪弹
    | '6.8x51'
    | '7.62x51 NATO'
    | '7.62x54 R'
    // 狙击弹
    | '.338 Lapua'
    | '12.7x99'
    | '14.5x114'
    // 霰弹
    | '12 号霰弹'
    // 中国特色
    | '35mm 榴弹'

export type 安装接口类型 =
      '根组件'
    | '直接连接'
    | '枪管连接'
    | '专用连接点'
    | { 类型: '导轨连接', 槽位数: 数值型, 方位: '上' | '侧' | '下' }

export interface 组件槽位类型 {
    标识: 文本型
    接口类型: 安装接口类型
    必须?: 布尔型
}

export interface 特性需求类型 {
    作用域: '父级' | '整枪'
    特性: 文本型
}

export interface 枪械参数类型 {
    /** kg */
    重量: 数值型
    /** m */
    有效射程: 数值型
    /** 0-100 */
    射击精度: 数值型
    /** 0-100 */
    后座控制: 数值型
    /** 0-100 */
    人机工效: 数值型
    /** 0-100 */
    击发威力: 数值型
    /** m/s */
    出膛速度: 数值型
    /** rpm */
    射速: 数值型
}

export interface 组件理型类型 {
    标识: 文本型
    名称: 文本型
    描述: 文本型
    接口类型: 安装接口类型
    参数?: 部分<枪械参数类型>

    子弹口径?: 子弹口径类型[]
    指定槽位?: 文本型[]
    快拆?: 布尔型
    快装?: 布尔型
    折叠?: 布尔型
    特性?: 文本型[]
    需求特性?: 特性需求类型[]
    排斥特性?: 特性需求类型[]
    提供槽位?: 组件槽位类型[]
}

export interface 根组件理型类型 extends 组件理型类型 {
    接口类型: '根组件'
    参数: 枪械参数类型
    子弹口径: [子弹口径类型]
    击发模式: 枪械击发模式类型[]
}
