import type { 根组件理型类型, 组件槽位类型, 组件理型类型 } from '../../模型/枪械'
import { 是 } from '../../讲中文才飞'

const AK机匣槽位: 组件槽位类型[] = [
    { 标识: 'AK导气', 接口类型: '直接连接', 必须: 是 },
    { 标识: 'AK护木', 接口类型: '直接连接', 必须: 是 },
    { 标识: 'AK后握', 接口类型: '直接连接', 必须: 是 },
    { 标识: 'AK枪托', 接口类型: '直接连接' },
    { 标识: 'AK机匣盖', 接口类型: '直接连接' },
    { 标识: 'AK燕尾槽', 接口类型: '专用连接点' }
]

export const AKM机匣: 根组件理型类型 = {
    标识: 'AKM机匣',
    名称: 'AKM机匣',
    描述: 'AKM突击步枪的核心组件',
    接口类型: '根组件',
    子弹口径: ['7.62x39'],
    击发模式: ['半自动', '全自动'],
    参数: {
        重量: 2.2,
        有效射程: 400,
        射击精度: 45,
        后座控制: 40,
        人机工效: 50,
        击发威力: 55,
        出膛速度: 715,
        射速: 750
    },
    提供槽位: [
        ...AK机匣槽位,
        { 标识: 'AK762枪口', 接口类型: '枪管连接' }
    ]
}

export const AK74机匣: 根组件理型类型 = {
    标识: 'AK74机匣',
    名称: 'AK74机匣',
    描述: 'AK74突击步枪的核心组件',
    接口类型: '根组件',
    子弹口径: ['5.45x39'],
    击发模式: ['半自动', '全自动'],
    参数: {
        重量: 2.1,
        有效射程: 500,
        射击精度: 55,
        后座控制: 52,
        人机工效: 55,
        击发威力: 48,
        出膛速度: 900,
        射速: 650
    },
    提供槽位: [
        ...AK机匣槽位,
        { 标识: 'AK545枪口', 接口类型: '枪管连接' }
    ]
}

export const AK102机匣: 根组件理型类型 = {
    标识: 'AK102机匣',
    名称: 'AK102机匣',
    描述: 'AK102突击步枪的核心组件',
    接口类型: '根组件',
    子弹口径: ['5.56x45'],
    击发模式: ['半自动', '全自动'],
    参数: {
        重量: 2.05,
        有效射程: 450,
        射击精度: 53,
        后座控制: 48,
        人机工效: 58,
        击发威力: 52,
        出膛速度: 820,
        射速: 700
    },
    提供槽位: [
        ...AK机匣槽位,
        { 标识: '556枪口', 接口类型: '枪管连接' }
    ]
}

export const AKM导气: 组件理型类型 = {
    标识: 'AKM导气',
    名称: 'AKM导气',
    描述: 'AKM步枪的导气组件',
    接口类型: '直接连接',
    指定槽位: ['AK导气'],
    参数: {
        重量: 0.28,
        后座控制: 1
    }
}

export const AK74导气: 组件理型类型 = {
    标识: 'AK74导气',
    名称: 'AK74导气',
    描述: 'AK74步枪的导气组件',
    接口类型: '直接连接',
    指定槽位: ['AK导气'],
    参数: {
        重量: 0.25,
        后座控制: 2
    }
}

export const AK102导气: 组件理型类型 = {
    标识: 'AK102导气',
    名称: 'AK102导气',
    描述: 'AK102步枪的导气组件',
    接口类型: '直接连接',
    指定槽位: ['AK导气'],
    参数: {
        重量: 0.26,
        后座控制: 2
    }
}

export const AK木质护木: 组件理型类型 = {
    标识: 'AK木质护木',
    名称: 'AK木质护木',
    描述: 'AK系列步枪的木质护木组件',
    接口类型: '直接连接',
    指定槽位: ['AK护木'],
    参数: {
        重量: 0.24,
        后座控制: 1
    }
}

export const AK聚合物护木: 组件理型类型 = {
    标识: 'AK聚合物护木',
    名称: 'AK聚合物护木',
    描述: 'AK系列步枪的聚合物护木组件',
    接口类型: '直接连接',
    指定槽位: ['AK护木'],
    参数: {
        重量: 0.18,
        后座控制: 1,
        人机工效: 2
    }
}

export const AK带导轨护木: 组件理型类型 = {
    标识: 'AK带导轨护木',
    名称: 'AK带导轨护木',
    描述: 'AK系列步枪的带导轨护木组件',
    接口类型: '直接连接',
    指定槽位: ['AK护木'],
    参数: {
        重量: 0.32,
        后座控制: 2,
        人机工效: 1
    },
    提供槽位: [
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 4, 方位: '下' } },
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 2, 方位: '侧' } },
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 2, 方位: '侧' } },
    ]
}

export const AK后握: 组件理型类型 = {
    标识: 'AK后握',
    名称: 'AK后握',
    描述: 'AK系列步枪的后握组件',
    接口类型: '直接连接',
    指定槽位: ['AK后握'],
    参数: {
        重量: 0.09,
        后座控制: 3,
        人机工效: 4
    }
}

export const AK木质枪托: 组件理型类型 = {
    标识: 'AK木质枪托',
    名称: 'AK木质枪托',
    描述: 'AK系列步枪的木质枪托组件',
    接口类型: '直接连接',
    指定槽位: ['AK枪托'],
    参数: {
        重量: 0.38,
        后座控制: 9
    },
    快拆: 是,
    快装: 是
}

export const 五六式折叠金属枪托: 组件理型类型 = {
    标识: '五六式折叠金属枪托',
    名称: '五六式折叠金属枪托',
    描述: '五六式冲锋枪的折叠金属枪托组件',
    接口类型: '直接连接',
    指定槽位: ['AK枪托'],
    参数: {
        重量: 0.44,
        后座控制: 5,
        人机工效: 1
    },
    折叠: 是,
    快拆: 是,
    快装: 是
}

export const AK机匣盖: 组件理型类型 = {
    标识: 'AK机匣盖',
    名称: 'AK机匣盖',
    描述: 'AK系列步枪的机匣盖组件',
    接口类型: '直接连接',
    指定槽位: ['AK机匣盖'],
    参数: {
        重量: 0.18,
        射击精度: 1
    }
}

export const AK带导轨机匣盖: 组件理型类型 = {
    标识: 'AK带导轨机匣盖',
    名称: 'AK带导轨机匣盖',
    描述: 'AK系列步枪的带导轨机匣盖组件',
    接口类型: '直接连接',
    指定槽位: ['AK机匣盖'],
    参数: {
        重量: 0.28
    },
    特性: ['AK上导轨'],
    提供槽位: [
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 4, 方位: '上' } }
    ]
}

export const AK燕尾槽支架: 组件理型类型 = {
    标识: 'AK燕尾槽支架',
    名称: 'AK燕尾槽支架',
    描述: 'AK系列步枪的燕尾槽支架',
    接口类型: '直接连接',
    指定槽位: ['AK燕尾槽'],
    参数: {
        重量: 0.11
    },
    提供槽位: [
        { 标识: '燕尾槽专用支架', 接口类型: '专用连接点' }
    ],
    排斥特性: [{ 作用域: '整枪', 特性: 'AK上导轨' }]
}

export const AKM斜切制退器: 组件理型类型 = {
    标识: 'AKM斜切制退器',
    名称: 'AKM斜切制退器',
    描述: '适用于AKM的斜切式枪口制退器',
    接口类型: '枪管连接',
    指定槽位: ['AK762枪口'],
    参数: {
        重量: 0.06,
        后座控制: 3,
        射击精度: -1
    }
}

export const AK74双室制退器: 组件理型类型 = {
    标识: 'AK74双室制退器',
    名称: 'AK74双室制退器',
    描述: '适用于AK-74系列的双室枪口制退器',
    接口类型: '枪管连接',
    指定槽位: ['AK545枪口'],
    参数: {
        重量: 0.09,
        后座控制: 7,
        射击精度: -1
    }
}

export const PSO1瞄准镜: 组件理型类型 = {
    标识: 'PSO-1瞄准镜',
    名称: 'PSO-1瞄准镜',
    描述: '安装在AK燕尾槽支架上的PSO-1瞄准镜',
    接口类型: '专用连接点',
    指定槽位: ['燕尾槽专用支架'],
    参数: {
        重量: 0.62
    }
}
