import type { 组件槽位类型, 组件理型类型 } from '../../模型/枪械'
import { 是 } from '../../讲中文才飞'

const AK机匣槽位: 组件槽位类型[] = [
    { 标识: 'AK导气', 接口类型: '直接连接', 必须: 是 },
    { 标识: 'AK护木', 接口类型: '直接连接', 必须: 是 },
    { 标识: 'AK后握', 接口类型: '直接连接', 必须: 是 },
    { 标识: 'AK枪托', 接口类型: '直接连接' },
    { 标识: 'AK机匣盖', 接口类型: '直接连接' },
    { 标识: 'AK燕尾槽', 接口类型: '专用连接点' },
    { 标识: 'AK枪口', 接口类型: '枪管连接' }
]

export const AKM机匣: 组件理型类型 = {
    标识: 'AKM机匣',
    名称: 'AKM机匣',
    描述: 'AKM突击步枪的核心组件',
    接口类型: '根组件',
    参数: {
        重量: 2.2,
        有效射程: 400,
        射击精度: 45,
        后座控制: 40,
        人机工效: 50,
        击发威力: 55,
        出膛速度: 715,
    },
    子弹口径: ['7.62×39'],
    提供槽位: AK机匣槽位,
}

export const AK74机匣: 组件理型类型 = {
    标识: 'AK74机匣',
    名称: 'AK74机匣',
    描述: 'AK74突击步枪的核心组件',
    接口类型: '根组件',
    子弹口径: ['5.45×39'],
    提供槽位: AK机匣槽位
}

export const AK74SU机匣: 组件理型类型 = {
    标识: 'AK74SU机匣',
    名称: 'AK74SU机匣',
    描述: 'AK74SU短突击步枪的核心组件',
    接口类型: '根组件',
    子弹口径: ['5.45×39'],
    提供槽位: AK机匣槽位
}

export const AK102机匣: 组件理型类型 = {
    标识: 'AK102机匣',
    名称: 'AK102机匣',
    描述: 'AK102突击步枪的核心组件',
    接口类型: '根组件',
    子弹口径: ['5.56×45'],
    提供槽位: AK机匣槽位
}

export const AKM导气: 组件理型类型 = {
    标识: 'AKM导气',
    名称: 'AKM导气',
    描述: 'AKM步枪的导气组件',
    接口类型: '直接连接',
    指定槽位: 'AK导气'
}

export const AK74导气: 组件理型类型 = {
    标识: 'AK74导气',
    名称: 'AK74导气',
    描述: 'AK74步枪的导气组件',
    接口类型: '直接连接',
    指定槽位: 'AK导气'
}

export const AK102导气: 组件理型类型 = {
    标识: 'AK102导气',
    名称: 'AK102导气',
    描述: 'AK102步枪的导气组件',
    接口类型: '直接连接',
    指定槽位: 'AK导气'
}

export const AK木质护木: 组件理型类型 = {
    标识: 'AK木质护木',
    名称: 'AK木质护木',
    描述: 'AK系列步枪的木质护木组件',
    接口类型: '直接连接',
    指定槽位: 'AK护木'
}

export const AK聚合物护木: 组件理型类型 = {
    标识: 'AK聚合物护木',
    名称: 'AK聚合物护木',
    描述: 'AK系列步枪的聚合物护木组件',
    接口类型: '直接连接',
    指定槽位: 'AK护木'
}

export const AK带导轨护木: 组件理型类型 = {
    标识: 'AK带导轨护木',
    名称: 'AK带导轨护木',
    描述: 'AK系列步枪的带导轨护木组件',
    接口类型: '直接连接',
    指定槽位: 'AK护木',
    提供槽位: [
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 4, 方位: '下' } },
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 2, 方位: '侧' } },
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 2, 方位: '侧' } },
    ]
}

export const AK后握: 组件理型类型 = {
    标识: 'AK后握',
    名称: 'AK后握',
    描述: 'AK系列步枪的后握组件',
    接口类型: '直接连接',
    指定槽位: 'AK后握'
}

export const AK木质枪托: 组件理型类型 = {
    标识: 'AK木质枪托',
    名称: 'AK木质枪托',
    描述: 'AK系列步枪的木质枪托组件',
    接口类型: '直接连接',
    指定槽位: 'AK枪托',
    快拆: 是,
    快装: 是
}

export const 五六式折叠金属枪托: 组件理型类型 = {
    标识: '五六式折叠金属枪托',
    名称: '五六式折叠金属枪托',
    描述: '五六式冲锋枪的折叠金属枪托组件',
    接口类型: '直接连接',
    指定槽位: 'AK枪托',
    折叠: 是,
    快拆: 是,
    快装: 是
}

export const AK机匣盖: 组件理型类型 = {
    标识: 'AK机匣盖',
    名称: 'AK机匣盖',
    描述: 'AK系列步枪的机匣盖组件',
    接口类型: '直接连接',
    指定槽位: 'AK机匣盖'
}

export const AK带导轨机匣盖: 组件理型类型 = {
    标识: 'AK带导轨机匣盖',
    名称: 'AK带导轨机匣盖',
    描述: 'AK系列步枪的带导轨机匣盖组件',
    接口类型: '直接连接',
    指定槽位: 'AK机匣盖',
    特性: ['AK上导轨'],
    提供槽位: [
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 4, 方位: '上' } }
    ]
}

export const AK燕尾槽连接组件: 组件理型类型 = {
    标识: 'AK燕尾槽连接组件',
    名称: 'AK燕尾槽连接组件',
    描述: 'AK系列步枪的燕尾槽连接组件',
    接口类型: '直接连接',
    指定槽位: 'AK燕尾槽',
    提供槽位: [
        { 标识: '燕尾槽专用支架', 接口类型: '专用连接点' }
    ],
    排斥特性: [{ 作用域: '整枪', 特性: 'AK上导轨' }]
}
