import type { 根组件理型类型, 组件槽位类型, 组件理型类型 } from '../../模型/枪械'
import { 占位参数 } from './占位参数'
import { 是 } from '../../讲中文才飞'

const 全尺寸AK槽位: 组件槽位类型[] = [
    { 标识: 'AK导气', 接口类型: '直接连接', 必须: 是 },
    { 标识: 'AK护木', 接口类型: '直接连接', 必须: 是 },
    { 标识: 'AK后握', 接口类型: '直接连接', 必须: 是 },
    { 标识: 'AK枪托', 接口类型: '直接连接' },
    { 标识: 'AK照门', 接口类型: '直接连接' },
    { 标识: 'AK机匣盖', 接口类型: '直接连接' },
    { 标识: 'AK燕尾槽', 接口类型: '专用连接点' }
]

export const AKM机匣: 根组件理型类型 = {
    标识: 'AKM机匣',
    名称: 'AKM机匣',
    描述: 'AKM突击步枪的核心组件',
    接口类型: '根组件',
    子弹口径: '7.62x39',
    击发模式: ['半自动', '全自动'],
    参数: 占位参数,
    提供槽位: [
        ...全尺寸AK槽位,
        { 标识: 'AK762枪口', 接口类型: '枪管连接' }
    ]
}

export const AK74机匣: 根组件理型类型 = {
    标识: 'AK74机匣',
    名称: 'AK74机匣',
    描述: 'AK74突击步枪的核心组件',
    接口类型: '根组件',
    子弹口径: '5.45x39',
    击发模式: ['半自动', '全自动'],
    参数: 占位参数,
    提供槽位: [
        ...全尺寸AK槽位,
        { 标识: 'AK545枪口', 接口类型: '枪管连接' }
    ]
}

export const AK102机匣: 根组件理型类型 = {
    标识: 'AK102机匣',
    名称: 'AK102机匣',
    描述: 'AK102突击步枪的核心组件',
    接口类型: '根组件',
    子弹口径: '5.56x45',
    击发模式: ['半自动', '全自动'],
    参数: 占位参数,
    提供槽位: [
        ...全尺寸AK槽位,
        { 标识: '556枪口', 接口类型: '枪管连接' }
    ]
}

export const AKM导气: 组件理型类型 = {
    标识: 'AKM导气',
    名称: 'AKM导气',
    描述: 'AKM步枪的导气组件',
    接口类型: '直接连接',
    指定槽位: ['AK导气']
}

export const AK74导气: 组件理型类型 = {
    标识: 'AK74导气',
    名称: 'AK74导气',
    描述: 'AK74步枪的导气组件',
    接口类型: '直接连接',
    指定槽位: ['AK导气']
}

export const AK102导气: 组件理型类型 = {
    标识: 'AK102导气',
    名称: 'AK102导气',
    描述: 'AK102步枪的导气组件',
    接口类型: '直接连接',
    指定槽位: ['AK导气']
}

export const AK木质护木: 组件理型类型 = {
    标识: 'AK木质护木',
    名称: 'AK木质护木',
    描述: 'AK系列步枪的木质护木组件',
    接口类型: '直接连接',
    指定槽位: ['AK护木']
}

export const AK聚合物护木: 组件理型类型 = {
    标识: 'AK聚合物护木',
    名称: 'AK聚合物护木',
    描述: 'AK系列步枪的聚合物护木组件',
    接口类型: '直接连接',
    指定槽位: ['AK护木']
}

export const AK带导轨护木: 组件理型类型 = {
    标识: 'AK带导轨护木',
    名称: 'AK带导轨护木',
    描述: 'AK系列步枪的带导轨护木组件',
    接口类型: '直接连接',
    指定槽位: ['AK护木'],
    提供槽位: [
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 4, 方位: '下' } },
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 2, 方位: '侧' } },
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 2, 方位: '侧' } },
    ]
}

export const AK后握: 组件理型类型 = {
    标识: 'AK后握',
    名称: 'AK后握',
    描述: 'AK系列步枪的后握组件',
    接口类型: '直接连接',
    指定槽位: ['AK后握']
}

export const AK木质枪托: 组件理型类型 = {
    标识: 'AK木质枪托',
    名称: 'AK木质枪托',
    描述: 'AK系列步枪的木质枪托组件',
    接口类型: '直接连接',
    指定槽位: ['AK枪托'],
    快拆: 是,
    快装: 是
}

export const 五六式折叠金属枪托: 组件理型类型 = {
    标识: '五六式折叠金属枪托',
    名称: '五六式折叠金属枪托',
    描述: '五六式冲锋枪的折叠金属枪托组件',
    接口类型: '直接连接',
    指定槽位: ['AK枪托'],
    折叠: 是,
    快拆: 是,
    快装: 是
}

export const AKM照门: 组件理型类型 = {
    标识: 'AKM照门',
    名称: 'AKM照门',
    描述: 'AKM步枪的照门组件',
    接口类型: '直接连接',
    指定槽位: ['AK照门'],
    排斥特性: [
        { 作用域: '整枪', 特性: 'AK直列式机匣盖' }
    ]
}

export const AK机匣盖: 组件理型类型 = {
    标识: 'AK机匣盖',
    名称: 'AK机匣盖',
    描述: 'AK系列步枪的机匣盖组件',
    接口类型: '直接连接',
    指定槽位: ['AK机匣盖']
}

export const AK带导轨机匣盖: 组件理型类型 = {
    标识: 'AK带导轨机匣盖',
    名称: 'AK带导轨机匣盖',
    描述: 'AK系列步枪的带导轨机匣盖组件',
    接口类型: '直接连接',
    指定槽位: ['AK机匣盖'],
    特性: ['AK上导轨'],
    提供槽位: [
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 4, 方位: '上' } }
    ]
}

export const AK直列式机匣盖: 组件理型类型 = {
    标识: 'AK直列式机匣盖',
    名称: 'AK直列式机匣盖',
    描述: 'AK系列步枪的直列式机匣盖组件',
    接口类型: '直接连接',
    指定槽位: ['AK机匣盖'],
    特性: ['AK上导轨', 'AK直列式机匣盖'],
    提供槽位: [
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 6, 方位: '上' } }
    ]
}

export const AK燕尾槽支架: 组件理型类型 = {
    标识: 'AK燕尾槽支架',
    名称: 'AK燕尾槽支架',
    描述: 'AK系列步枪的燕尾槽支架',
    接口类型: '直接连接',
    指定槽位: ['AK燕尾槽'],
    参数: {
        重量: 0.11
    },
    提供槽位: [
        { 标识: '燕尾槽专用支架', 接口类型: '专用连接点' }
    ],
    排斥特性: [{ 作用域: '整枪', 特性: 'AK上导轨' }]
}

export const AKM斜切制退器: 组件理型类型 = {
    标识: 'AKM斜切制退器',
    名称: 'AKM斜切制退器',
    描述: '适用于AKM的斜切式枪口制退器',
    接口类型: '枪管连接',
    指定槽位: ['AK762枪口'],
    参数: {
        重量: 0.06,
        后座控制: 3,
        射击精度: -1
    }
}

export const AK74双室制退器: 组件理型类型 = {
    标识: 'AK74双室制退器',
    名称: 'AK74双室制退器',
    描述: '适用于AK-74系列的双室枪口制退器',
    接口类型: '枪管连接',
    指定槽位: ['AK545枪口'],
    参数: {
        重量: 0.09,
        后座控制: 7,
        射击精度: -1
    }
}

export const PSO1瞄准镜: 组件理型类型 = {
    标识: 'PSO-1瞄准镜',
    名称: 'PSO-1瞄准镜',
    描述: '安装在AK燕尾槽支架上的PSO-1瞄准镜',
    接口类型: '专用连接点',
    指定槽位: ['燕尾槽专用支架'],
    参数: {
        重量: 0.62
    }
}
