import type { 组件槽位类型, 组件理型类型 } from '../../模型/枪械'

const AK机匣槽位: 组件槽位类型[] = [
    { 标识: 'AK导气', 接口类型: '直接连接' },
    { 标识: 'AK后握', 接口类型: '直接连接' },
    { 标识: 'AK护木', 接口类型: '直接连接' },
    { 标识: 'AK枪托', 接口类型: '直接连接' },
    { 标识: 'AK机匣盖', 接口类型: '直接连接' },
    { 标识: 'AK燕尾槽', 接口类型: '直接连接' }
]

export const AKM机匣: 组件理型类型 = {
    标识: 'AKM机匣',
    名称: 'AKM机匣',
    描述: 'AKM突击步枪的核心组件',
    接口类型: '根组件',
    提供槽位: AK机匣槽位
}

export const AK74机匣: 组件理型类型 = {
    标识: 'AK74机匣',
    名称: 'AK74机匣',
    描述: 'AK74突击步枪的核心组件',
    接口类型: '根组件',
    提供槽位: AK机匣槽位
}

export const AK74SU机匣: 组件理型类型 = {
    标识: 'AK74SU机匣',
    名称: 'AK74SU机匣',
    描述: 'AK74SU短突击步枪的核心组件',
    接口类型: '根组件',
    提供槽位: AK机匣槽位
}

export const AKM导气: 组件理型类型 = {
    标识: 'AKM导气',
    名称: 'AKM导气',
    描述: 'AKM步枪的导气组件',
    接口类型: '直接连接',
    指定槽位: 'AK导气'
}

export const AK74导气: 组件理型类型 = {
    标识: 'AK74导气',
    名称: 'AK74导气',
    描述: 'AK74步枪的导气组件',
    接口类型: '直接连接',
    指定槽位: 'AK导气'
}

export const AK102导气: 组件理型类型 = {
    标识: 'AK102导气',
    名称: 'AK102导气',
    描述: 'AK102步枪的导气组件',
    接口类型: '直接连接',
    指定槽位: 'AK导气'
}
