import type { 根组件理型类型, 组件槽位类型, 组件理型类型 } from '../../模型/枪械'
import { 是 } from '../../讲中文才飞'

export const JR15步枪: 根组件理型类型 = {
    标识: 'JR15步枪',
    名称: 'JR15步枪',
    描述: 'JR15步枪的核心组件',
    接口类型: '根组件',
    子弹口径: ['.22 LR'],
    击发模式: ['半自动'],
    参数: {
        重量: 1,
        有效射程: 100,
        射击精度: 80,
        后座控制: 70,
        人机工效: 80,
        击发威力: 25,
        出膛速度: 400,
        射速: 300
    },
    提供槽位: [
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 8, 方位: '上' } },
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 4, 方位: '下' } },
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 2, 方位: '侧' } },
        { 标识: '导轨', 接口类型: { 类型: '导轨连接', 槽位数: 2, 方位: '侧' } },
    ]
}
